# # Составить программу, в результате которой
# # величина а меняется значением с величиной b, а
# # величина c – с величиной d. (Определить процедуру,
# # осуществляющую обмен значениями двух переменных
# # величин.)
#
# def magnitude(a, b, c , d):
#     a, b = b, a
#     c, d = d, c
#     return (a, b, c, d)
# print(magnitude(1,2,3,4))


# # Задача 12
def perimetr(a1,b1,c1,a2,b2,c2):
    return ((a1+b1+c1)+(a2+b2+c2))
print(perimetr(1,2,3,4,5,6))
def square(a1,b1,c1,a2,b2,c2):
    p1 = ((a1+b1+c1)/2)
    p2 = ((a2+b2+c2)/2)
    s1 = (p1*(p1-a1)*(p1-b1)*(p1-c1))**0.5
    s2 = (p2*(p2-a2)*(p2-b2)*(p2-c2))**0.5
    return s1 + s2
print(square(3,4,5,3,4,5))